In [1]:
import sqlite3

In [3]:
database_name = "biblio"

connection = sqlite3.connect(database_name)
cursor = connection.cursor()

In [4]:
cursor.execute(
    '''
    CREATE TABLE Book(
        id INT PRIMARY KEY NOT NULL,
        title TEXT,
        author TEXT,
        publish_year INT
    )
    '''
)

In [5]:
cursor.execute(
    '''
    INSERT INTO Book VALUES
    (1, 'Harry Potter and the Philosopher''s Stone', 'J. K. Rowling', 1997),
    (2, 'Методы решения задач в общем курсе физики, Механика', 'Корявов В.П.', 2007),
    (3, 'Batman: Gotham by Gaslight', 'Brian Augustyn, Mike Mignola', 1989),
    (4, 'Мёртвые души', 'Н. В. Гоголь', 1842),
    (5, 'The Running Man', 'Richard Bachman', 1982)
    '''
)

In [ ]:
connection.commit()

In [6]:
cursor.execute(
    '''
    CREATE TABLE Reader(
        id INT PRIMARY KEY NOT NULL,
        name TEXT
    )
    '''
)

In [7]:
cursor.execute(
    '''
    INSERT INTO Reader VALUES
    (1, 'V.V. Petrovich'),
    (2, 'Alexanderr'),
    (3, 'Arkadiy Svidrigaylov'),
    (4, 'Vitalya'),
    (5, 'Noname')
    '''
)

In [8]:
cursor.execute(
    '''
    CREATE TABLE Record(
        id INT PRIMARY KEY NOT NULL,
        reader_id INT REFERENCES Readers(id) NOT NULL,
        book_id INT REFERENCES Books(id) NOT NULL,
        taking_date TEXT,
        returning_date TEXT
    )
    '''
)

In [9]:
cursor.execute(
    '''
    INSERT INTO Record VALUES
    (1, 3, 4, '1842-02-14', '1842-07-01'),
    (2, 4, 4, '1996-10-26', NULL),
    (3, 1, 2, '2006-06-13', '2006-06-14'),
    (4, 1, 1, '2006-06-14', '2006-06-15'),
    (5, 1, 3, '2006-06-15', '2006-07-20'),
    (6, 2, 5, '1985-10-11', '1987-12-25'),
    (7, 5, 3, '2001-03-15', NULL),
    (8, 5, 3, '2002-09-19', '2002-09-25')
    '''
)

In [10]:
connection.commit()
connection.close()

In [11]:
connection = sqlite3.connect(database_name)
cursor = connection.cursor()

In [12]:
def list_of_books(cursor):
  cursor.execute("SELECT * FROM Book")
  for row in cursor.execute("SELECT id, title FROM Book"):
    print(*row)

In [13]:
def list_of_readers(cursor):
  cursor.execute("SELECT * FROM Reader")
  for row in cursor.execute("SELECT * FROM Reader"):
    print(*row)

In [23]:
def add_book(cursor, name, author, year):
  cursor.execute("SELECT Count(*) FROM Book")
  id = cursor.fetchone()[0]
  new_book = [
    (id + 1, name, author, year),    
  ]

  connection.executemany(
    "INSERT INTO Book VALUES (?, ?, ?, ?)",
    new_book
  )

In [24]:
def add_reader(cursor, reader):
  
  cursor.execute("SELECT Count(*) FROM Reader")
  id = cursor.fetchone()[0]

  new_pearson = [
    (id + 1, reader)   
  ]

  connection.executemany(
    "INSERT INTO Reader VALUES (?, ?)",
    new_pearson
  )

In [25]:
add_book(cursor, 'teremok', 'narod', 2021)

In [26]:
list_of_books(cursor)

1 Harry Potter and the Philosopher's Stone
2 Методы решения задач в общем курсе физики, Механика
3 Batman: Gotham by Gaslight
4 Мёртвые души
5 The Running Man
6 teremok

In [27]:
add_reader(cursor, 'Luda')

In [28]:
list_of_readers(cursor)

1 V.V. Petrovich
2 Alexanderr
3 Arkadiy Svidrigaylov
4 Vitalya
5 Noname
6 Petr Pavlovitch
7 Luda

Предыдущие функции работают, проверили. Попробуем дальше.

In [29]:
def give_book(cursor, k1, k2, date):
  cursor.execute("SELECT Count(*) FROM Record")
  id = cursor.fetchone()[0]
  new_record = [
    (id + 1, k1, k2, date, None)   
  ]

  connection.executemany(
    "INSERT INTO Record VALUES (?, ?, ?, ?, ?)",
    new_record
  )

In [35]:
def check_records(cursor):
  cursor.execute("SELECT * FROM Record")
  for row in cursor.execute("SELECT * FROM Record"):
    print(*row)

In [56]:
def receive_book(cursor, k1, k2, date1, date2):
  cursor.execute("SELECT Count(*) FROM Record")
  id = cursor.fetchone()[0]
  new_record = [
    (id + 1, k1, k2, date1, date2)   
  ]

  connection.executemany(
    "INSERT INTO Record VALUES (?, ?, ?, ?, ?)",
    new_record
  )

In [53]:
give_book(cursor, 1, 3, '2020-09-28')

In [54]:
check_records(cursor)

1 3 4 1842-02-14 1842-07-01
2 4 4 1996-10-26 None
3 1 2 2006-06-13 2006-06-14
4 1 1 2006-06-14 2006-06-15
5 1 3 2006-06-15 2006-07-20
6 2 5 1985-10-11 1987-12-25
7 5 3 2001-03-15 None
8 5 3 2002-09-19 2002-09-25
9 1 3 2020-09-28 None
10 1 3 2020-09-28 None
11 1 3 2020-09-28 None
12 1 3 2020-09-28 None
13 1 3 2020-09-28 None
14 1 3 2020-09-28 None

In [57]:
receive_book(cursor, 2, 3, '2020-06-12', '2020-07-12')

In [58]:
check_records(cursor)

1 3 4 1842-02-14 1842-07-01
2 4 4 1996-10-26 None
3 1 2 2006-06-13 2006-06-14
4 1 1 2006-06-14 2006-06-15
5 1 3 2006-06-15 2006-07-20
6 2 5 1985-10-11 1987-12-25
7 5 3 2001-03-15 None
8 5 3 2002-09-19 2002-09-25
9 1 3 2020-09-28 None
10 1 3 2020-09-28 None
11 1 3 2020-09-28 None
12 1 3 2020-09-28 None
13 1 3 2020-09-28 None
14 1 3 2020-09-28 None
15 2 3 2020-06-12 2020-07-12

Вроде работает...